data_set = {
    # Приветствие
    "привет": "Здравствуйте! Как я могу вам помочь?",
    "приве": "Здравствуйте! Как я могу вам помочь?",  # Опечатка
    "прив": "Здравствуйте! Как я могу вам помочь?",  # Опечатка
    "здравствуйте": "Здравствуйте! Как я могу вам помочь?",
    "здраствуй": "Здравствуйте! Как я могу вам помочь?",  # Опечатка
    "хай": "Здравствуйте! Как я могу вам помочь?",
    "салам алейкум": "Здравствуйте! Как я могу вам помочь?",
    "салам": "Здравствуйте! Как я могу вам помочь?",

    # Как дела?
    "как дела": "У меня все отлично! А у вас?",
    "каг дела": "У меня все отлично! А у вас?",  # Опечатка
    "как дела?": "У меня все отлично! А у вас?",  # Вопросительный знак
    "как дел": "У меня все отлично! А у вас?",  # Опечатка
    "какие дела": "У меня все отлично! А у вас?",
    "как ты": "У меня все отлично! А у вас?",
    # Ответы на "Как дела?"
    "хорошо": "Рад слышать! Чем могу вам помочь?",
    "отлично": "Рад слышать! Чем могу вам помочь?",
    "нормально": "Понятно. Чем могу вам помочь?",
    "плохо": "Жаль слышать. Как я могу вам помочь?",
    "не очень": "Жаль слышать. Как я могу вам помочь?",
    "так себе": "Жаль слышать. Как я могу вам помочь?",
    "неважно": "Вас понял. Как я могу вам помочь?",

    # Помощь
    "помощь": "Чем я могу вам помочь?",
    "помошь": "Чем я могу вам помочь?",  # Опечатка
    "помоч": "Чем я могу вам помочь?",  # Опечатка
    "помогите": "Чем я могу вам помочь?",
    "помоги": "Чем я могу вам помочь?",
    "помог": "Чем я могу вам помочь?",
    "помогите мне": "Чем я могу вам помочь?",
    # Ответы на "Помощь"
    "оплата": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "информация о компании": "ТОО «Специальная финансовая компания «р2п инвест КЗ» создана в соответствии с Законом Республики Казахстан.",
    "сменить язык": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",

    # Оплата
    "оплата": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "оплата долга": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "как оплатить": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "платеж": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "задолженность": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    "задолг": "Для получения подробной информации о способах оплаты воспользуйтесь командой /start для вызова главного меню.",
    # Опечатка

    # Информация о компании
    "информация о компании": "ТОО «Специальная финансовая компания «р2п инвест КЗ» создана в соответствии с Законом Республики Казахстан.",
    "о компании": "ТОО «Специальная финансовая компания «р2п инвест КЗ» создана в соответствии с Законом Республики Казахстан.",
    "кто вы": "ТОО «Специальная финансовая компания «р2п инвест КЗ» создана в соответствии с Законом Республики Казахстан.",
    "компания": "ТОО «Специальная финансовая компания «р2п инвест КЗ» создана в соответствии с Законом Республики Казахстан.",

    # Выбор языка
    "сменить язык": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",
    "смена языка": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",
    "изменить язык": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",
    "выбор языка": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",
    "язык": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",
    "language": "Для выбора языка воспользуйтесь командой /start для вызова главного меню.",

    # Ответы на "Оплата"
    "дополнительные вопросы": "Если у вас есть дополнительные вопросы по оплате, пожалуйста, уточните их.",
    "информация по долгу": "Если у вас есть вопросы по задолженности, дайте знать, и я постараюсь помочь.",

    # Ответы на "Информация о компании"
    "дополнительные детали": "Если вам нужны дополнительные детали о компании, пожалуйста, уточните, что именно вас интересует.",

    # Ответы на "Выбор языка"
    "другие языки": "Если вы хотите выбрать другой язык, пожалуйста, воспользуйтесь командой /start для вызова главного меню.",
    "непонятно": "Если что-то непонятно, не стесняйтесь уточнить. Я здесь, чтобы помочь. Или можете поменять язык, если вы плохо понимаете казахсикй.",

    "не знаю": "Печально. Напишите ваш вопрос.",

"сука": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "блядь": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "пиздец": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "ебануться": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "рот ебал": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "ебал": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "выродок": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "нахуй": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "пашел нахуй": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "хуй": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "ебать": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "пизда": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "мразь": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "гандон": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "дерьмо": "Пожалуйста, избегайте использования нецензурной лексики. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "тупой": "Пожалуйста, избегайте использования оскорблений. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "дебил": "Пожалуйста, избегайте использования оскорблений. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
    "ублюдок": "Пожалуйста, избегайте использования оскорблений. Согласно статье 319 Уголовного кодекса Республики Казахстан, за использование оскорблений и нецензурной лексики предусмотрены штрафы или административный арест. Данная запись разговора будет отправлена на проверку.",
}
